x = 5 #2진수 로 표현 2 2 = 4 2 0 = 1 4 +1 5
'''
2에 거듭제곱으로 사용한다
5 / 2 = 2몫 나눈 나머지 1
2 / 2 = 1몫 나눈 나미지 0
1 / 2 = 0몫 나눈 마머지 1
아래서 위로 읽는다
'''
x &= 3
'''
3의 이진수
3 /2 =1 몫 나머지 1
1 /2 = 0 몫 나머지 1
'''
print(x)
'''
비트 AND연산은 두 숫자를 2진수(비트)로 바꾸고
각자리에서 둘다 1일때만 1이 되는 연산

1)10진수를 2진수로 변환
5 
'''


x=3
y=2
print( x // y) #원래값은 7.5이나 가장 가까운 정수로 출력합니다

oper = '''
파이선 연산자
- 산술연산자 [Arithmetic operators] : 일반적인 수학 연산
+, -, * , /, %, **, //[결과 가까운 정수로 반올림 합니다
- 할당연산자 [Assignment operators] : 변수에 값을 할당하는데 사용
=, +=, -=, *=, /=, %=, 
&= 비트연산자 

- 비교연산자 [Comparison operators]
- 논리연산자 [Logical operators]
- 항등연산자 [Identity operators]
- 맴버쉽운영자 [Membership operators]
- 비트 연산자 [Bitwise operators]
'''